{
  "special" : {
    "analog" : "This weapon does not use any advanced electronics, computer systems, or electrical power sources. It is immune to abilities that target technology. While this use of the word “analog” is not technically correct when referring to technology, use of the term in this way has become common.",
    "archaic" : "This weapon deals 5 fewer damage unless the target is wearing no armor or archaic armor. Archaic weapons are made of primitive materials such as wood or common steel.",
    "automatic" : "In addition to making ranged attacks normally, a weapon with this special property can fire in fully automatic Mode. No action is required to toggle a weapon between making normal ranged attacks and using automatic Mode.\n\nWhen you make a full attack with a weapon in automatic Mode, you can attack in a cone with a range of half the weapon’s range increment. This uses all the weapon’s remaining ammunition. Roll one attack against each target in the cone, starting with those closest to you. Attacks made with a weapon in automatic Mode can’t score critical hits. Roll damage only once, and apply it to all targets struck. Each attack against an individual creature in the cone uses up the same amount of ammunition or charges as taking two shots, and once you no longer have enough ammunition to attack another target, you stop making attacks.\n\nFor example, if you were using a Tactical X-gen gun with 27 rounds remaining, you would target the nearest 6 creatures in the cone and use up all 27 rounds.\n\nIf more than one creature is equidistant and you don’t have enough cartridges remaining to shoot at all equidistant creatures, determine randomly which one you target. You can’t avoid shooting at allies in the cone, nor can you shoot any creature more than once, even if you have enough cartridges to fire more shots than you have targets. Attacks in automatic Mode take the same penalties as other full attacks.",
    "blast" : "This weapon fires in a cone that extends only to its first range increment. You can’t use it to attack creatures beyond that range.\n\nFor each attack you make with a weapon with the blast special property, roll one attack against each target in the cone, starting with those closest to you. Each attack takes a –2 penalty in addition to other penalties, such as the penalty to all attacks during a full attack. Roll damage only once for all targets. If you roll one or more critical hits, roll the extra critical damage only once (or any other special effects on a critical hit that require you to roll) and apply it to each creature against which you score a critical hit. You can’t avoid shooting at allies in the cone, nor can you shoot any creature more than once.\n\nAttacks with blast weapons ignore concealment. A blast weapon doesn’t benefit from feats or abilities that increase the damage of a single attack (such as the operative’s trick attack). Ammunition for blast weapons is designed for blast attacks, so you spend the usage amount only once for each cone of attacks.",
    "block" : "Only melee weapons can have the block special property, which represents some kind of guard or crossbar that can protect you from attacks by a foe you strike in melee. When you successfully strike a target with a melee attack using such a weapon, you gain a +1 enhancement bonus to your AC for 1 round against melee attacks from that target.",
    "boost" : "You can charge up a weapon with this special property as a move action. When you do, you increase the weapon’s damage by the listed amount on the next attack you make with the weapon. Boosting expends charges from the weapon equal to its usage value. This increases the weapon’s damage and is multiplied on a critical hit. Boosting a weapon more than once before firing it doesn’t have any extra effect, and the extra charge dissipates if the weapon is not fired by the end of your next turn.",
    "bright" : "Attacks with bright weapons illuminate the area within 20 feet of you and your target for 1 round following the attack, increasing the illumination level by one step, to a maximum of normal light.",
    "disarm" : "When you attempt a disarm combat maneuver while wielding a weapon with the disarm special property, you gain a +2 bonus to your attack roll.",
    "entangle" : "A creature hit by an entangle weapon becomes entangled until it escapes with an Acrobatics check (DC = 10 + weapon’s item level + the attacker’s Dexterity modifier) or a Strength check (DC = 15 + weapon’s item level + the attacker’s Dexterity modifier). An entangled creature can attempt such a check as a move action. Some weapons (such as stickybomb grenades) have a maximum duration for this effect. See the entangled condition.",
    "explode" : "Explosives have the explode special property, which lists the amount of damage the explosion deals, the damage type, special effects (with a duration, if necessary), and the radius of the explosion. When you attack with this type of weapon or ammunition, aim at a grid intersection. Each creature within the blast radius takes the listed damage but can attempt a Reflex saving throw for half damage. If the explode special property has any special effects other than damage, they are negated with a successful saving throw. Some exploding weapons, such as smoke grenades, don’t deal damage, so they don’t include the damage and damage type entries.",
    "injection" : "This weapon or its ammunition can be filled with a drug, an injury poison, or a medicinal compound. On a successful attack with the weapon (either the first attack if it’s a melee weapon or an attack with the relevant piece of ammunition if it’s a ranged weapon), the weapon automatically injects the target with the substance.",
    "refilling" : "The weapon with a new substance acts as reloading it and is a move action. Each different injectable material must be bought separately and can be used in any weapon with the injection special property. See rules and prices for drugs, medicinals, and poisons.",
    "line" : "This weapon fires a projectile in a straight line that pierces through multiple creatures or obstacles. When attacking with such a weapon, make a single attack roll and compare it to the relevant Armor Class of all creatures and objects in a line extending to the weapon’s listed range increment. Roll damage only once. The weapon hits all targets with an AC equal to or lower than the attack roll. However, if an attack fails to damage a creature or obstacle hit in the line (typically due to damage reduction or hardness), the path is stopped and the attack doesn’t damage creatures farther away. A line weapon can’t damage targets beyond its listed range. If you score a critical hit, that effect applies only to the first target hit in the line, and you roll the critical damage separately. If multiple creatures are equally close, you choose which one takes the effects of the critical hit. A line weapon doesn’t benefit from feats or abilities that increase the damage of a single attack (such as the operative’s trick attack).",
    "nonlethal" : "This weapon deals nonlethal damage.",
    "operative" : "An operative can use the trick attack class feature with a weapon that has this special property. Any character can add her Dexterity modifier rather than her Strength modifier on melee attack rolls with weapons with this special property.",
    "penetrating" : "A penetrating weapon is designed to punch through large objects’ outer layers, making it easier to damage them. A penetrating weapon ignores an amount of hardness equal to the weapon’s level.",
    "powered" : "A melee weapon with an internal battery that must be charged to function has the powered special property, which lists its capacity and usage. Unlike with a ranged weapon, the usage is for 1 minute of operation rather than per attack, though using a powered weapon for less than 1 full minute still expends 1 full usage. The number of charges expended is equal to the usage × the number of minutes the weapon is used, rounded up to the nearest minute. You can activate the power of the weapon as part of the action used to make an attack with it, and it automatically deactivates after 1 minute.\n\nSome weapons that explode or cause critical hit effects allow the target to attempt a saving throw. The DC of such a saving throw is typically equal to 10 + half the weapon’s item level + one of your ability modifiers. Unless stated otherwise, the ability modifier corresponds to the ability score you’d normally use to make an attack with that weapon (Dexterity for a ranged or thrown weapon, and Strength for a melee weapon). Any penalty you would normally take to your weapon attack roll also applies to this DC, including penalties from the weapon’s range increment.\n\nAs with ranged weapons, you can recharge the battery of a powered melee weapon using a generator or a recharging station, or you can purchase new batteries for it. If you try to attack with a powered weapon that’s out of charges, it functions as an improvised weapon.",
    "quick" : "You can reload this weapon as part of the same action as firing it, instead of taking a move action to reload.",
    "reach" : "Only melee weapons can have the reach special property. Wielding a weapon with reach gives you 10 feet of reach for attacks with that weapon. See Reach and Threatened Squares for more information.",
    "sniper" : "Weapons with the sniper special property can be fired accurately at very long ranges if aimed properly. If you aim the weapon as a move action and then fire it on the same turn, use the value listed with the sniper special property as the weapon’s range increment. You can still fire a sniper weapon as normal, but it has only the range listed under its normal range entry when you do.",
    "stun" : "You can set a weapon with the stun special property to stun Mode (or reset it to normal Mode) as a move action. While in stun Mode, all the weapon’s attacks are nonlethal.",
    "thrown" : "Ranged weapons that must be thrown and melee weapons that can be thrown as a ranged attack have the thrown special property. You apply your Strength modifier to damage rolls for thrown attacks. After you throw a weapon, it lands near your target and you must recover it if you want to attack with it again.",
    "trip" : "When you attempt a trip combat maneuver while wielding a weapon with this property, you gain a +2 bonus to your attack roll.",
    "unwieldy" : "Weapons with the unwieldy special property are large and awkward, can’t be fired without cooling down first, or are otherwise difficult to use with repeated attacks. You can’t use an unwieldy weapon as part of a full attack (or any other action in which you could make multiple attacks), you can’t attack with it more than once per round, and you can’t use it to make an attack of opportunity."
  }
}